{
    "menu.about": "O mnie",
    "menu.skills": "Umiejętności",
    "menu.panel": "Site Wizard",
    "menu.portfolio": "Portfolio",
    "menu.contact": "Kontakt",


    "hero.description": "Zajmuję się tworzeniem stron oraz aplikacji internetowych w oparciu o HTML, CSS (SCSS oraz Tailwind), Javascript i Laravel. Obecnie rozwijam także mój projekt <button class=\"hero__link\">SiteWizard</button>.",

    "about.paragraph1": "Nazywam się Jakub Lipiński, jestem 22 letnim Full-stack Developerem. Obecnie pracuję w agencji StronyDlaFirm.eu. Pracuję z witrynami i aplikacjami internetowymi opartymi o <span class=\"section__colored\">HTML, CSS, PHP oraz Javascript</span>.",
    "about.paragraph2": "Jeśli chodzi o frameworki i preprocesory to mój wybór padł na <span class=\"section__colored\">Laravel oraz React</span> (w przyszłości chcę również nauczyć się Vue), a do stylowania swoich projektów używam <span class=\"section__colored\">SCSS (głównie BEM) oraz Tailwind CSS</span>.",
    "about.paragraph3": "Obecnie moim głównym projektem jest <span class=\"section__colored\">Site Wizard - autorski panel administracyjny oparty o Laravela oraz Tailwind, który na bieżąco rozwijam</span> i używam w swoich projektach.",
    "about.paragraph4": "Posiadam również doświadczenie w pracy z różnymi CMS, głównie <span class=\"section__colored\">Wordpress oraz Prestashop</span>, głównie z zakresu tworzenia nowych, utrzymywania i konserwacji istniejsących stron opartych na tych właśnie CMS.Zdarza się również, że modyfikuję motywy pod konkretne potrzeby klienta.",

    "about.heading": "O mnie",
    "about.subheading": "Poznajmy się",

    "skills.heading": "Umiejętności",
    "skills.subheading": "Technologie i narzedzia, z którymi pracuję",
    "skills.description": "W trakcie swojej pracy z web developmentem nauczyłem się kilku języków i technologii oraz przetestowałem kilka narzędzi. Te najważniejsze wymieniłem na kartach obok.",
    "skills.other": "Inne",
    "skills.swipe": "Przesuń palcem!",

    "panel.heading": "Site Wizard",
    "panel.subheading": "Moje autorskie rozwiązanie dla stron internetowych",
    "panel.description1": "Stworzyłem mój panel administracyjny, który wdrażam w kolejne strony internetowe. Oprócz podstawowych funkcji jak zarządzanie treścią na stronie (dodawanie wpisów, usług, meta tagów itd) wyposażyłem go w bardziej <span class=\"section__colored\">zaawansowane funkcje jak wysyłanie wiadomości Whatsapp, zarządzanie newsletterami, czy dodawanie i zarządzanie załącznikami oraz odbieranie wiadomości od zalogowanych klientów</span>.",
    "panel.description2": "Panel umożliwia również zarządzanie administratorami - <span class=\"section__colored\">dodawanie, usuwanie i zmiany hasła kont z autoryzowanym dostępem</span>.",
    "panel.description3": "To rozwiązanie umożliwia mi szybsze tworzenie stron internetowych, ponieważ nie muszę za każdym razem tworzyć od zera całego systemu CMS.",
    "panel.description4": "Wykorzystane technologie i narzędzia to: <span class=\"section__colored\">HTML, Tailwind, JavaScript, PHP, Laravel, Breeze, MySQL, Laravel Scout, Twilio</span>",
    "panel.description5": "Panel jest stale rozwijamy, a <span class=\"section__colored\">pełna lista funkcji oraz zmian jest dostępna w moim repozytorium na Githubie</span>.",

    "portfolio.heading": "Portfolio",
    "portfolio.subheading": "Moje najważniejsze projekty",

    "github.repo": "Repozytorium Github",
    "private.repo": "Repozytorium prywatne",
    "see.online": "Zobacz online",

    "justtag.title": "Just Tag",
    "justtag.description": "Strona internetowa agencji badającej zachowania użytkownikw offline i online. <span class=\"section__colored\">W tym projekcie zajmowałem się implementacją warstwy front-end z dostarczonego projektu graficznego za pomocą HTML, CSS oraz Javascript</span>. Dodatkowo przygotowałem pliki .json z tłumaczeniami - strona jest dostępna w języku polskim i angielskim.",

    "plastic.title": "Panel Site Wizard dla plastic-trader.com",
    "plastic.description": "Wdrożenie mojego autorskiego panelu site wizard do strony plastic-trader.com. Administrator może zarządzać treściami na stronie (dodawanie usług, produktów, wpisów na blog) <span class=\"section__colored\">oraz komunikować się z klientami - Przesyłać im wiadomości Whatsapp i mail z poziomu panelu administracyjnego oraz odbierać wiadomości przesyłane przez zarejestrowanych klientów</span>.",

    "digitalowa.title": "Panel Administracyjny strony digitalowa.pl",
    "digitalowa.description": "Prosty panel administracyjny dla strony digitalowa.pl pozwalający na zarządzanie treścią: dodawanie usług, edycję tekstów, czy zmianę danych kontaktowych. <span class=\"section__colored\">Panel został stworzony w oparciu o pakiet Voyager</span>. Zrzuty ekranu z panelu oraz wytłumaczenie działania dostępne w pliku readme repozytorium.",

    "movie.title": "Movie App",
    "movie.description": "Aplikacja korzystająca z API The Movie Database. Umożliwia rejestrację oraz logowanie użytkowników, przeglądanie kategorii, filmów, seriali i aktorów. <span class=\"section__colored\">Zalogowani użytkownicy mogą dodawać filmy do ulubionych oraz do własnych list. Zaimplementowana została również wyszukiwarka oparta o Livewire</span> w celu zapewnienia lepszej interaktywności.",

    "olza.title": "Olza.pl",
    "olza.description": "Zaawansowana witryna internetowa stworzona dla Stowarzyszenie Rozwoju i Współpracy Regionalnej „Olza” z siedzibą w Cieszynie z podziałem na serwisy: sportowy, kulturalny, turystyczny oraz bank fotografii. Serwis zawiera ponad 40000 tysięcy aktualnosci, kilkaset galerii oraz wiele dokumentów i informacji z całego regionu cieszyńskiego. <span class=\"section__colored\">Witryna posiada również zaawansowaną wyszukiwarkę wydarzeń i imprez, a także system logowania i umożliwia pobieranie zdjęć z galerii tylko zalogowanym użytkownikom</span>.",

    "dog.title": "Dog Cafe",
    "dog.description": "Prosty landing page psiej kawiarni, przygotowałem tutaj warstwę front-end wzroując się na stronie kociej kawiarni z UK. <span class=\"section__colored\">Strona została wyposażona w panel adminsitracyjny Voyager, w którym skonfigurowałem możliwość dodawania zwierząt oraz oferty kawiarni.</span> Strona posiada również prosty formularz kontaktowy",

    "design.title": "Design Alive",
    "design.description": "DesignAlive to portal z artykułami ze świata szeroko pojętego designu <span class=\"section__colored\">z około 30 tysiącami aktywnych użytkowników każdego miesiąca</span>. W tym projekcie zajmowałem się utrzymywaniem aktualności i bezpieczeństwa strony, konserwacją oraz <span class=\"colored\">wprowadzaniem nowych rozwiązań do portalu</span>.",

    "iuvo.title": "Sklep IUVO laser",
    "iuvo.description": "Jest to sklep internetowy oparty o system Prestashop. W tym projekcie oprócz wdrożenia motywu czy dodania produktów i kategorii, <span class=\"section__colored\">zmodyfikowałem szablon i wtyczki według polecenia klienta</span>.",

    "idea.title": "Idea Domu",
    "idea.description": "Portal z artykułami zawierającymi projekty i realizacje domów nowoczesnych, a także wskazówki i ciekawoski odnośnie aranżacji wnętrz. W pracy z tą witryną zajmuję się <span class=\"section__colored\">wdrażaniem nowych rozwiązań, modyfikacją motywów, wtyczek</span>, a także utrzymania bezpieczeństwa i szybkości strony.",

    "works.all": "Zobacz wszystkie realizacje",
    "projects.heading": "Pozostałe projekty",

    "contact.heading": "Kontakt",
    "contact.subheading": "Napisz do mnie",
    "contact.description": "Moja skrzynka jest zawsze otwarta, więc niezależnie od tego, czy masz pytanie lub po prostu się przywitać - odpiszę tak szybko jak to możliwe!",

    "form.email": "Email (wymagane)",
    "form.phone": "Numer telefonu",
    "form.subject": "Temat",
    "form.message": "Treść wiadomości (wymagane)",
    "form.send": "Wyślij wiadomość",

    "footer.text": "Projekt i realizacja - Jakub Lipiński",


    "projects.name1": "StronyDlaFirm.eu",
    "projects.name2": "SOiZ",
    "projects.name3": "Budsystem",
    "projects.name4": "Biblioteka w Dębowcu",
    "projects.name5": "Multienerga.de",
    "projects.name6": "Plastic Trader",

    "projects.description1": "Witryna firmy, w której pracuję. Została oparta o Wordpress oraz <span class=\"section__colored\">szablon, który zmodyfikowałem tak aby był jak najbardziej zgodny z wizerunkiem firmy</span>. Zajmowałem się również przeniesieniem treści ze starej strony oraz konfiguracją narzędzi do pomiaru ruchu na stronie.",
    "projects.description2": "Strona internetowa SOiZ w Cieszynie. Warstwa front-end pochodzi z szablonu wykupionego na Envato, ja <span class=\"section__colored\">zajmowałem się jego dostosowaniem oraz podpięciem panelu administracyjnego Voyager</span>. Strona posiada również zaawansowany formularz rekrutacyjny do szkoły.",
    "projects.description3": "Strona www firmy zajmującej się remontami oraz budową domów. <span class=\"section__colored\">W tym projekcie zajmowałem się podłączeniem panelu administracyjnego Voyager do strony</span>. Administrator może dodawać projekty oraz usługi a także odczytywać wiadomości bezpośrednio w panelu.",
    "projects.description4": "Strona internetowa biblioteki Publicznej w Dębowcu oparta o Wordpress oraz szablon korzystający z edytora Gutenberg. Szablon dostosowałem w taki sposób, aby był w 100% zgodny z wymaganiami WCAG 2.1 dzięki czemu <span class=\"section__colored\">witryna uzyskała certyfikat dostępności cyfrowej</span>.",
    "projects.description5": "Strona internetowa firmy zajmującej się m.in fotowoltaiką. <span class=\"section__colored\">Witryna została stworzona na Wordpressie i szablonie korzystającego z Elementora</span>. Szablon oraz panel administracyjny dostosowałem w taki sposób, aby klient mógł samodzielnie wprowadzać nowe treści na stronę.",
    "projects.description6": "Prosta witryna firmy zajmującej się skupem oraz sprzedażą tworzyw sztucznych. <span class=\"section__colored\">Szablon Wordpress korzystający z Elementora dostosowałem pod potrzeby klienta</span>. Zainstalowałem również wszystkie najważniejsze narzędzia do pomiaru ruchu na stronie."
}
